results-shopcart-native/run_5_2026-01-05_01-16-04/FIXED-800-latency-1-dump.txt
Running 30s test @ http://127.0.0.1:8001
  16 threads and 16 connections
  Thread calibration: mean lat.: 0.919ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.883ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.873ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.858ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.898ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.843ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.868ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.850ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.836ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.864ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.847ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.849ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.831ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.840ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.834ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.854ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.96ms  319.45us   5.04ms   62.91%
    Req/Sec    52.15     51.89   111.00     83.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.96ms
 75.000%    1.21ms
 90.000%    1.38ms
 99.000%    1.54ms
 99.900%    1.92ms
 99.990%    4.33ms
 99.999%    5.05ms
100.000%    5.05ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.174     0.000000            1         1.00
       0.545     0.100000         1602         1.11
       0.655     0.200000         3199         1.25
       0.759     0.300000         4807         1.43
       0.860     0.400000         6401         1.67
       0.957     0.500000         8003         2.00
       1.004     0.550000         8792         2.22
       1.056     0.600000         9592         2.50
       1.106     0.650000        10393         2.86
       1.158     0.700000        11198         3.33
       1.210     0.750000        11998         4.00
       1.235     0.775000        12390         4.44
       1.262     0.800000        12798         5.00
       1.291     0.825000        13191         5.71
       1.322     0.850000        13588         6.67
       1.351     0.875000        13990         8.00
       1.365     0.887500        14203         8.89
       1.379     0.900000        14387        10.00
       1.393     0.912500        14594        11.43
       1.408     0.925000        14790        13.33
       1.422     0.937500        14988        16.00
       1.429     0.943750        15086        17.78
       1.439     0.950000        15191        20.00
       1.448     0.956250        15293        22.86
       1.458     0.962500        15396        26.67
       1.471     0.968750        15491        32.00
       1.477     0.971875        15540        35.56
       1.483     0.975000        15585        40.00
       1.491     0.978125        15638        45.71
       1.502     0.981250        15687        53.33
       1.514     0.984375        15737        64.00
       1.521     0.985938        15763        71.11
       1.528     0.987500        15786        80.00
       1.538     0.989062        15812        91.43
       1.551     0.990625        15837       106.67
       1.563     0.992188        15860       128.00
       1.571     0.992969        15874       142.22
       1.579     0.993750        15885       160.00
       1.591     0.994531        15898       182.86
       1.615     0.995313        15910       213.33
       1.636     0.996094        15922       256.00
       1.650     0.996484        15928       284.44
       1.662     0.996875        15935       320.00
       1.687     0.997266        15941       365.71
       1.719     0.997656        15947       426.67
       1.761     0.998047        15953       512.00
       1.779     0.998242        15956       568.89
       1.827     0.998437        15960       640.00
       1.858     0.998633        15963       731.43
       1.867     0.998828        15966       853.33
       1.923     0.999023        15969      1024.00
       1.927     0.999121        15970      1137.78
       2.055     0.999219        15972      1280.00
       2.159     0.999316        15974      1462.86
       2.211     0.999414        15975      1706.67
       3.373     0.999512        15977      2048.00
       3.373     0.999561        15977      2275.56
       3.723     0.999609        15978      2560.00
       3.769     0.999658        15979      2925.71
       3.927     0.999707        15980      3413.33
       4.159     0.999756        15981      4096.00
       4.159     0.999780        15981      4551.11
       4.159     0.999805        15981      5120.00
       4.331     0.999829        15982      5851.43
       4.331     0.999854        15982      6826.67
       4.571     0.999878        15983      8192.00
       4.571     0.999890        15983      9102.22
       4.571     0.999902        15983     10240.00
       4.571     0.999915        15983     11702.86
       4.571     0.999927        15983     13653.33
       5.047     0.999939        15984     16384.00
       5.047     1.000000        15984          inf
#[Mean    =        0.959, StdDeviation   =        0.319]
#[Max     =        5.044, Total count    =        15984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24016 requests in 30.00s, 7.17MB read
Requests/sec:    800.51
Transfer/sec:    244.80KB